Revit 2024 API
PointLightShape Members
The PointLightShape type exposes the following members.
Constructors
Name | Description
PointLightShape()
 Creates a point light shape object.
PointLightShape(PointLightShape)
 Creates a copy of the given point light shape
Methods
Name | Description
Clone
 Creates a copy of the LightShape derived object.
 (Inherited from LightShape.)
Dispose |  (Inherited from LightShape.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightShape.)
See Also
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace